import {
  IQuestionTypes,
  IResultTypes,
  IScoreTypes,
} from "@/common/types/mbti-type";

export const MbtiResultData: IResultTypes[] = [
  {
    mbti: "ISTJ",
    titleName: "클리어 슬라임",
    summary: "클리어처럼 깔끔한 당신은",
    description:
      "맑고 투명한 클리어 슬라임과 같은 당신은 깔끔한 클리어처럼 계획적인 게 좋고, 즉흥적인 걸 싫어해요. 다른 슬라임과 섞이면 바로 티가 나는 법, 다가오지 마! 사람들이 많은 곳은 싫어요! 나 혼자, 알아서 알잘딱깔센하는 편이에요. 남에게 관심도 없고, 좋아하는 사람이 아니면 미안하지만, tmi로 들릴 수도 있어요. 철벽도 잘 쳐서 남들이 보기엔 딱딱해 보이지만, 실수하면 자책도 많이 하는 편이에요. 그리고 내 편이면 누구보다 든든한 사람이랍니다.",
  },
  {
    mbti: "ISFJ",
    titleName: "버터 슬라임",
    summary: "꾸덕꾸덕, 부들부들 버터 슬라임과 같은 당신은",
    description:
      "꾸덕꾸덕한 버터 슬라임같이 부드러운 당신은 배려왕! 타인을 배려하고, 챙겨주는 걸 좋아하는 예의 있는 사람이에요. 겸손한 면도 있어서 주변에서도 이미지가 좋답니다. 성격도 온화한 편이에요. 조용한 아싸무리에서는 인싸, 인싸무리에서는 조용한 아싸인 당신. 혼자 있으면 마음이 편안해져요. 집에 있는 것도 좋지만, 외로움을 타서 친구들과 주기적으로 놀러 나가야 한답니다. 어떨 때는 소극적인데 어떨 때는 또 불도저 같아요. 나도 날 몰라!",
  },
  {
    mbti: "INFJ",
    titleName: "쿠앤크 슬라임",
    summary: "까만 초코, 하얀 초코. 두가지 면을 가진 당신은",
    description:
      "하얀 초코, 까만 초코가 조화롭게 어우러진 쿠앤크 슬라임과 같은 당신은 따뜻한 모습으로 사람들에게 사랑받아요. 생각이 많은 당신은 다른 사람이 날 어떻게 생각하는지, 방금 말은 어떤 의미인지 곱씹어보게 돼요. 타인에 대한 선도 명확해서, 선을 넘으면 끝이에요. 왜 그러냐구요? 툭, 잘못 건드리면 조각나는 쿠앤크처럼 속이 매우 여려서 상처를 잘 받기 때문이에요. 감성도 풍부해서 주변에서 눈물이 많다는 이미지일지도 몰라요. 하얀 쿠키처럼 따스하다가도, 까만 초코처럼 어떨땐 냉정해보이기도 해요. 조심조심, 쿠키가 부서지지 않게 잘 다루어주세요.",
  },
  {
    mbti: "INTJ",
    titleName: "규칙적인 파츠를 가진 슬라임",
    summary:
      "일렬로 줄서! 완벽하게 계산된 갯수와 종류의 파츠를 머금은 슬라임같은 당신은",
    description:
      "파츠의 종류, 정렬도 완벽하게 슬라임에 넣는 당신은, 계획적이고 규칙적인 게 좋아요. 하루를 보낼 때도 정해놓은 계획에 맞추어 보내는 게 좋아요. 원리 원칙대로,  딱딱 맞춰서 하는 게 좋아요. 혼자 있는 게 좋은 당신은, 단체활동을 좋아하지 않아요. 하지만 막상 단체활동에 들어가면 리드하는 역할을 담당하게 될 때도 있어요. 너 사회화된 T야? 한 번쯤 들어보지 않았나요? 솔직히 친구 고민 듣다 보면… 공감이 안 될 때가 많아요. 하지만 겉으로는 관심 있는척한답니다. 그래도 가끔 티가 나나 봐요, 남 연애사는 정말, 관심이 없거든요… 이성적이지만 감성적인 당신, 무신경하다는 말도 듣지만, 살짝 관종일지도 몰라요. 하지만 내성적이라 티는 못 내는 편이죠. (귀여워)",
  },
  {
    mbti: "ISTP",
    titleName: "랜덤 슬라임",
    summary: "뭐가 나올까? 호불호가 확실한 랜덤 슬라임과 같은 당신은",
    description:
      "랜덤 슬라임, 아... 이거 싫어하는데. 또 뭐가 나오려나? 호불호가 확실한 당신은 관심있는 분야에서는 완전 전문가st에 끝장을 보는 성격이에요. 하지만 관심 없는 것에는 눈길 하나 주지않아요. 내가 하는 거에 참견하지 마, 꼰대같은 위계질서로 간섭하면 정말 화낼지도 몰라요. 항상 효율적으로 융통성있게 행동하고 싶어요. 남에게 관심 없어요, 내 이야기도 굳이... 싶어요. 혹시 읽씹으로 유명하지 않나요? 의미없는 대화 이어가기는 싫어요. 맡은 일도 잘 해서 내 자신이 자랑스러워요. 이렇게만 보면 친해지기 어려운 사람이지만, 그 벽을 뚫고 친해지고 나면 또 다른 매력이 있답니다? 조잘조잘, 말도 잘 하고 귀여운면이 있을지도 몰라요. ",
  },
  {
    mbti: "ISFP",
    titleName: "쫀득모찌 슬라임",
    summary:
      "모찌모찌! 추욱… 바닥에 붙어있어요. 침대를 너무너무 사랑하는 당신은",
    description:
      "쫀득 모찌 슬라임과 같은 당신은, 아, 귀찮아! 침대가 너무 좋아요! 부들부들한 성격을 가진 당신은 친구들과의 갈등을 싫어해요. 남들이 자꾸 말랑하다고 찌르는데, 싫은데… 은근히 기분 좋아요. 은근히 관심을 원할지도? 하지만 티나게 관심받긴 싫어요. 말랑말랑한 성격탓에 거절을 잘 못 해요, 양보도 잘하는 편. 어느곳에 놔두어도 잘 흘러가는 모찌슬라임처럼, 주변의 분위기를 잘 타는 편이에요. 하지만 말랑한 겉과 다르게 어느정도의 고집은 있답니다? 남에게 속마음도 잘 말하지 않아요. 노는 건 좋아, 근데... 기빨려요. 집순이라는 말, 많이 들어봤죠? 약속이 취소되면..., 은근히 좋을 때도 있어요.",
  },
  {
    mbti: "INFP",
    titleName: "장난감 슬라임",
    summary:
      "장난감이 가득 들어가있어! 아이디어가 넘치는 작은 선물가게같은 당신은",
    description:
      "선물가게에 들어가면 설레지 않나요? 이것저것, 여러 가지를 볼 수 있으니까요. 당신과 비슷해요, 속에서 이런저런 생각이 많은 당신이에요. 어, 이 장난감 예쁘다… 내가 가질래. 이건 어떤 거지? 어떤 하나에 꽂히면 미친 듯이 파고들어요, 하지만 빨리 질리기도 한답니다. 자기애가 강한 당신은 나를 너무 사랑해요, 하지만 이런 내 성격이 싫을 때도 있어요. 자존감이 조금 낮을지도 몰라요. 낯도 많이 가려요, 혼자 있는 게 좋지만 외로움도 많이 타는 편이에요. 힘든 일이 있어도 남에게 의지하고 싶지 않아요, 의지하는 것도 어색해. 스스로 해결하려고 해요. 한번 싫은 건 끝까지 싫어요, 화가 나면 혼자 내버려뒀으면 좋겠어요.",
  },
  {
    mbti: "INTP",
    titleName: "딱딱한 퍼티 슬라임",
    summary: "이건 뭘까, 저건 뭘까, 분석하는게 좋은 당신은",
    description:
      "찢으며 노는 재미가 있는 퍼티 슬라임과 같은 당신은, 다른 슬라임과 섞이기 어려운 퍼티 슬라임처럼 혼자 있는걸 좋아해요. 찢어서 노는 퍼티처럼 남들이 보기엔 다른 슬라임보다는 딱딱해 보여요, 하지만 그만큼 내면이 단단하다는 거겠죠? 당신의 단단한 내면은 감정 기복이 크게 없어요. 상처도 잘 안 받구요. 다른 슬라임은 말랑거린다고? 난 신경 안 써. 남들의 시선같은 거, 잘 신경 쓰지 않아요. 마이웨이! 처음 만지는 사람은 당황스러운 퍼티겠지만, 만지다 보면 은근히 중독되면서 마니아층이 생겨나는 것처럼 나에게 남아있어 주는 사람과는 잘 지내는 편이에요.",
  },
  {
    mbti: "ESTP",
    titleName: "보석 슬라임",
    summary: "반짝 반짝, 보석 슬라임처럼 빛나는 당신은",
    description:
      "사회에서도, 친구들 사이에서도 리더 역할을 담당하고 있지 않나요? 당신의 충동적이면서도 설득력 있는 말에 모두들 당신을 리더로 인정하고 있을 거예요. 충동적, 즉흥적, 스릴, 전부 당신과 딱 어울리는 단어들이에요. 눈치도 빠르고, 쿨하기까지. (멋지다, 이사람...) 슬라임 안에 들어간 반짝 반짝, 가만히 있어도 빛나는 보석과 같은 당신은 다른 사람이 관심을 가져주는게 좋아요. 하지만 당신은 남에게 별로 관심이 없을 수도…? 난 너한테 관심 없는데? 조금은 직설적인 말투로 남들에게 상처를 줄 지도 몰라요. 하지만 의외로 외로움을 탄답니다? 많이 예뻐해주세요.",
  },
  {
    mbti: "ESFP",
    titleName: "펄유니콘 슬라임",
    summary: "어디서나 주목받는 유니콘과 같은 당신은",
    description:
      "펄이 촤르르, 유니콘 등장! 주목받는 게 좋은 당신은, 남들이 관심을 가져주는게 너무 좋아요. 친구는 내 친구, 친구의 친구도 내 친구, 다 불러! 모임엔 사람이 많을수록 좋지! 사교성이 매우 좋아요. 대화 도중에 침묵은 용서 못 해! 인싸 그 잡채인 당신. 유행에도 예민해서 모르는 게 없어요. 집에 있는 것보다 밖으로 나가는 게 좋아요, 혼자 있는 것도 지루해. 친구들이 좋아요. 그런 당신도 나름의 고민이 있답니다. 주목받는 게 가끔 부서질 때가 있거든요. 화가 나면 쉽게 흥분하기도 하고요. 거절도 잘 못 하는 편이에요. 싫어하는 사람 앞에서는 표정 관리도 되지 않는 편이에요.",
  },
  {
    mbti: "ENFP",
    titleName: "푸른 하늘 슬라임",
    summary: "푸른 하늘처럼 탁 트인 당신은",
    description:
      "푸른 하늘처럼 자유로우면서 포용적인 마음을 가진 당신은, 인싸라는 말에 딱 어울리는 사람이에요. 어디서나 긍정적인 당신은 친구가 좋아, 친구 사귀는 것도 좋아. 새로운 사람 좋아. 타인을 좋아해요. 리액션 맛집! 남의 말도 잘 들어줘서 고민 상담하러 오는 친구들이 많아요. 자유로운게 좋아요, 날 구속하려 드는건 싫어. 입에 발린 말도 잘 못하는 편이에요. 싫증도 잘 내는 편이에요, 반복적인 것도 싫어. 벼락치기를 자주 하는 편이지만 집중력이 좋아서 결과는 잘 나오는 편이에요.",
  },
  {
    mbti: "ENTP",
    titleName: "크런치 슬라임",
    summary: "으드득, 으드득 만지는 재미가 있는 크런치 슬라임과 같은 당신은",
    description:
      "으드드득, 만지는 재미가 있지만, 호불호가 갈리는 크런치 슬라임과 같은 당신은, 딱딱한 파츠만큼 직설적이고 솔직한 편이에요. 내 길은 내가 알아서 간다. 다른 사람들에게 관심? 없어요, 어떻게 생각하든지 상관 안 써요. 혼자가 편해요, 독립적인 성격이에요. 기면 기고, 아니면 아니에요. 내가 좋아하고 나에게 잘해주는 사람에게든 뭐든지 해주고 싶지만, 아닌 사람은 0.000.1도 없어요. 관심사도 마찬가지, 관심 없으면 하나도 몰라요. 아니면 아닌 거야, 입에 발린 말 같은 거 안 해요. 말싸움에서는 이겨야 속이 시원한 편이에요. 왜 이걸 못 하지…? 이런 생각도 가끔 드는 당신이지만, 사람을 좋아하고 외로움도 타는 편이랍니다.",
  },
  {
    mbti: "ESTJ",
    titleName: "뾰족뾰족 파츠 슬라임",
    summary: "아야아야, 뾰족한 세모 파츠같은 당신은",
    description:
      "너 눈을 왜 그렇게 떠...? 날카로운 눈빛으로 주변사람들에게 예리한 팩폭을 날리는 당신은 객관적, 현실적으로 판단하고 확실하게 행동하는걸 좋아해요. 시간약속도 칼같이, 규칙도 칼같이 지킨답니다. 남이 그걸 어긴다면? 하...(극혐) 뒷담같은거 안 해요. 앞에서 못 할 말 뒤에서도 안 해요. 목표가 생기면 미친듯이 파고드는 편. 한우물만 파요. 애매한 걸 싫어하지만, 예외가 있다면... 저기 친구야... 나 이런 고민이 있는데. 그럼 이렇게 이렇게 하고, 저렇게 해. 니가 이걸 안 해서 그런 거잖아. 니 잘못이야... 라고 말하고 싶지만 상처받을까 봐 그렇게는 못 하고 뜨뜻미지근하게 대답하는 편이에요. 의외로 다정할지도?",
  },
  {
    mbti: "ESFJ",
    titleName: "찰싹 치젤몬 슬라임",
    summary:
      "어떤 슬라임이든 나를 만나면 달라져! 치젤몬 슬라임과 같은 친화력을 가진 당신은",
    description:
      "어느 슬라임과도 어우러지는 치젤몬 슬라임과 같은 당신은, 친구나 새로운 사람과 함께 있는 즐거움이 너무 좋아요! 어색한 건 참을 수 없어, 안녕? 먼저 말 걸어주는 편이에요. (너 e야?) 이 슬라임… 치젤몬을 넣어야겠어. 타인의 고민 또한 잘 들어주고, 내 사람은 누구보다 잘 챙겨주려고 노력해요. 그만큼 주변에서 고민 상담도 많이 들어달라고 하는 편일 거예요. 하지만 치젤몬을 너무 많이 넣어서 이 슬라임… 망했어. 인간관계에 예민해요, 남한테 싫은 소리도 못 하는 편에 감정기복도 심한 편이라 스트레스를 쉽게 받기도 해요. 하지만 사람에게 받은 스트레스, 사람으로 푸는 당신. 누구보다 타인을 사랑하는 사람이에요.",
  },
  {
    mbti: "ENFJ",
    titleName: "오독 오독 슬라임",
    summary: "예쁜 파츠들이 모여 듣기좋은 소리를 내는 슬라임과 같은 당신은",
    description:
      "오독 오독, 만질 때마다 기분 좋은 소리가 들리는 슬라임 같은 당신은, 피리 부는 사나이처럼 사람들이 잘 따르고, 그만큼 남을 잘 이끌어 준답니다. 의사소통에 뛰어난 소질이 있어요. 사람을 좋아하고, 다른 사람들에게도 잘 맞춰줘요. 센스있고 눈치가 빨라서 자신보다는 타인을 먼저 생각하고 행동하는 사람이에요. 사람을 좋아해서 싫은 소리도 잘 못 해서 눈치를 보기도 해요. 계획 짜는 게 좋아요, 계획대로 이끌어나가는 것도 잘하지만 계획이 틀어지면 그만큼 스트레스를 많이 받는답니다. 많이 사랑받고 싶은 당신! 주변에 ENFJ가 있다면 많이 사랑해주세요!",
  },
  {
    mbti: "ENTJ",
    titleName: "네모 큐브 크런치 슬라임",
    summary: "딱딱하고 단단한 크런치 슬라임처럼 단단한 내면을 가진 당신은",
    description:
      "네모 큐브 파츠를 머금은 슬라임을 만지다 보면 손이 아려오기도... 크런치 슬라임과 같은 당신은, 너 T야? 사회에서 불리는 T라는 말에 제일 어울리는 사람일지도 모르겠어요. 감정에 호소? 내게 그런 건 안 먹힌다. 무조건적인 공감보다는, 해결책을 제시해주는 성격이에요. 현실적이면서도 논리적인 당신은 똑똑하기도 하고, 그만큼 자존감도 높아요. 열등감? 그런 거 느낀 지 너무 오래됐는데... 학창시절에 조별과제 버스 기사 많이 해보지 않았나요? 하... 저렇게 하는 거 진짜 비효율적인데, 내가 하고 말지. 실수를 반복하는 비효율적인 사람을 이해할 수 없어요, 저런 사람에게 맡기느니 내가 하는 게 낫다 주의예요. 세상에 믿을 사람은 나뿐이거든요. 그만큼 카리스마 넘치고, 자존감이 단단한 믿음직한 사람이에요.",
  },
];

//질문
export const MbtiQuestionData: IQuestionTypes = {
  "1": {
    question: "슬라임을 만들려고 합니다! 당신이 먼저 한 일은 무엇인가요?",
    answers: [
      {
        score: "J",
        text: "슬라임 종류, 재료 살 곳, 재료 종류 등을 인터넷으로 검색해본다.",
      },
      {
        score: "P",
        text: "일단 밖으로 나가본다, 밖에서 문구점부터 찾아본다!",
      },
    ],
    select: "",
  }, //j,p
  "2": {
    question: "만들 슬라임의 종류를 정해보자! 당신의 모습은?",
    answers: [
      {
        score: "S",
        text: "퍼티, 클라우드, 버터 등의 종류를 확실하게 정한다.",
      },
      {
        score: "N",
        text: "정해진 틀에 구애받지 않을래! 상상의 나래를 펼쳐본다",
      },
    ],
    select: "",
  }, //s,n
  "3": {
    question: "슬라임 만들 준비 끝! 이제 만들러 가야하는데...",
    answers: [
      {
        score: "E",
        text: "친구들한테 연락해서 같이 만들어볼까? 다같이 의견을 주고받으면 더 재밌을 거야!",
      },
      {
        score: "I",
        text: "역시 혼자서 상상의 나래를 펼치는게 좋지. 집으로 가자!",
      },
    ],
    select: "",
  }, //e,i
  "4": {
    question: "사온 재료로 슬라임을 만들어보자! 슬라임을 만들 때 당신의 모습?",
    answers: [
      {
        score: "J",
        text: "정확한 비율 및 레시피, 재료의 배분 등을 따져가며 만든다.",
      },
      {
        score: "P",
        text: "만들어보면서 재료의 배합을 바꾸거나, 새로운 도전을 해본다.",
      },
    ],
    select: "",
  }, //j,p
  "5": {
    question: "슬라임을 만들 때 당신의 모습은?",
    answers: [
      {
        score: "E",
        text: "인스타 라이브, 유튜브 방송 등을 찍으며 사람들과 소통하며 만든다.",
      },
      {
        score: "I",
        text: "방해받지 않는 나만의 공간에서 슬라임을 만든다.",
      },
    ],
    select: "",
  }, //e,i
  "6": {
    question: "슬라임에 파츠를 넣어보자!! 어떻게 넣을까?",
    answers: [
      {
        score: "J",
        text: "여러개의 파츠를 색상, 갯수 비율에 맞춰서 넣는다.",
      },
      {
        score: "P",
        text: "예쁜 것부터, 손에 잡히는대로 이것저것 넣어본다.",
      },
    ],
    select: "",
  }, //j,p
  "7": {
    question:
      "친구와 함께 슬라임을 만들고 있다. 근데 친구 슬라임이 실패할 것 같은데...",
    answers: [
      {
        score: "F",
        text: "친구야, 여기 치젤몬을 조금 더 넣어보는건 어때? 아, 이상하단건 아니고~!",
      },
      {
        score: "T",
        text: "친구야, 그거 그렇게 계속하면 슬라임 녹을걸? 치젤몬 넣어야할 것 같아~",
      },
    ],
    select: "",
  }, //f,t
  "8": {
    question: "친구들에게 내 슬라임을 자랑했다! 친구들의 대답은?",
    answers: [
      {
        score: "S",
        text: "어, 이거 버터 슬라임이지? 시중에 파는거랑 엄청 비슷한데?",
      },
      {
        score: "N",
        text: "이건 무슨 슬라임이야? 처음 보는데? 니가 새로 만든 거야?",
      },
    ],
    select: "",
  }, //f,t
  "9": {
    question:
      "친구들에게 슬라임을 나누어줬다! 근데 친구가 몇번 만져보더니 반응이 좋지 않다... 그래도 나눠줘서 고맙다는 친구에게 할 말은?",
    answers: [
      {
        score: "F",
        text: "다음에는 좀 더 잘 만들어볼게! (고맙다고 해줘서 기분 좋음)",
      },
      {
        score: "T",
        text: "아... 다음에는 좀 더 잘 만들어볼게! 혹시 어떤 부분이 별로야? (어떤 부분이 이상한거지?)",
      },
    ],
    select: "",
  }, //t,f
  "10": {
    question: "만든 슬라임을 SNS에 올려보려고 합니다! SNS 설명 내용은?",
    answers: [
      {
        score: "S",
        text: "물 200g, 물풀 200g, 베이킹소다 10g, 80도 물을 넣고 10번 젓는다... ",
      },
      {
        score: "N",
        text: "몽글몽글 구름이 떠올르는 몽글구름슬라임, 하늘을 표현하기 위해 저만의 재료인...",
      },
    ],
    select: "",
  }, //s,n
  "11": {
    question: "이제 완성한 슬라임을 가지고 놀자! 어떻게 가지고 놀까?",
    answers: [
      {
        score: "I",
        text: "내 방, 내 책상, 나만의 공간에서 혼자 슬라임을 만지며 시간을 보낸다.",
      },
      {
        score: "E",
        text: "친구들을 모으자! 내 바풍 실력을 친구들에게 보여준다.",
      },
    ],
    select: "",
  }, //i,e
  "12": {
    question: "슬라임을 가지고 놀때 나는?",
    answers: [
      {
        score: "S",
        text: "슬라임의 말랑말랑한 촉감, 소리에 집중하며 스트레스를 해소한다.",
      },
      {
        score: "N",
        text: "나는야 유튜버! 슬라임 유튜버가 되었다고 상상하며 가지고 논다.",
      },
    ],
    select: "",
  }, //s,n
};

export const scoreInitData: IScoreTypes = {
  I: 0,
  E: 0,
  S: 0,
  N: 0,
  F: 0,
  T: 0,
  J: 0,
  P: 0,
};
